; domain
(define
    (domain hanoi)
    (:requirements :adl)
    (:types disk rod)
    (:predicates
        (clear ?x)    
        (on-top ?x ?y)
        (on-floor ?k)
        (on-rod ?x ?k)
        (empty ?x)
        (bigger ?x ?y)
    )

    (:action przesun-na-pusty
        :parameters (?from ?to ?disc) 
        :precondition
        (and
            (not (= ?from ?to))
            (empty ?to)
            (on-rod ?from ?disc)
            (clear ?disc)
        )
        :effect
        (and
            (when (on-floor ?disc)
                (empty ?from)
            )
            (not (empty ?to))
            (not (on-rod ?from ?disc))
            (on-rod ?to ?disc)
            (on-floor ?disc)
            (forall (?otherdisc - disk)
            (when (and (on-top ?disc ?otherdisc) (on-rod ?from ?otherdisc))
            (and
                (clear ?otherdisc)
                (not (on-top ?disc ?otherdisc))
                )
            ))
        )
    )
    
    (:action przesun
        :parameters (?from ?to ?topdisc ?bottomdisc) 
        :precondition
        (and
            (not (= ?from ?to))
            (not (= ?topdisc ?bottomdisc))
            (clear ?topdisc)
            (clear ?bottomdisc)
            (on-rod ?from ?topdisc)
            (on-rod ?to ?bottomdisc)
            (not (bigger ?topdisc ?bottomdisc))
        )
        :effect
        (and
            (when (on-floor ?topdisc)
                (empty ?from)
            )
            (on-rod ?to ?topdisc)
            (not (on-rod ?from ?topdisc))
            (not (on-floor ?topdisc))
            (forall (?otherdisc - disk)
            (when (and (on-top ?topdisc ?otherdisc) (on-rod ?from ?otherdisc))
            (and
                (clear ?otherdisc)
                (not (on-top ?topdisc ?otherdisc))
                )
            ))
             (on-top ?topdisc ?bottomdisc)
             (not (clear ?bottomdisc))
        )
    )
)

; problem
(define (problem p1)
	(:domain hanoi)
	(:objects x y z - rod k1 k2 k3 k4 k5 - disk)
	(:init
	    (empty y)
	    (empty z)
	    (on-top k4 k5)
	    (on-top k3 k4)
	    (on-top k2 k3)
	    (on-top k1 k2)
	    (on-rod x k1)
	    (on-rod x k2)
	    (on-rod x k3)
	    (on-rod x k4)
	    (on-rod x k5)
	    (bigger k2 k1)
	    (bigger k3 k1)
	    (bigger k4 k1)
	    (bigger k5 k1)
	    (bigger k3 k2)
	    (bigger k4 k2)
	    (bigger k5 k2)
	    (bigger k4 k3)
	    (bigger k5 k3)
	    (bigger k5 k4)
	    (clear k1)
	    (on-floor k5)
	)
	(:goal
		(and
		    (on-rod z k1)
		    (on-rod z k2)
		    (on-rod z k3)
		    (on-rod z k4)
		    (on-rod z k5)
		)
	)
)

; plan
1. (przesun-na-pusty x z k1)
   deleted: (empty z) (on-rod x k1) (on-top k1 k2)
   added: (on-rod z k1) (on-floor k1) (clear k2)
   goals met: 1 of 5
2. (przesun-na-pusty x y k2)
   deleted: (empty y) (on-rod x k2) (on-top k2 k3)
   added: (on-rod y k2) (on-floor k2) (clear k3)
   goals met: 1 of 5
3. (przesun z y k1 k2)
   deleted: (on-rod z k1) (on-floor k1) (clear k2)
   added: (empty z) (on-rod y k1) (on-top k1 k2)
   goals met: 0 of 5
4. (przesun-na-pusty x z k3)
   deleted: (empty z) (on-rod x k3) (on-top k3 k4)
   added: (on-rod z k3) (on-floor k3) (clear k4)
   goals met: 1 of 5
5. (przesun y x k1 k4)
   deleted: (on-rod y k1) (on-top k1 k2) (clear k4)
   added: (on-rod x k1) (clear k2) (on-top k1 k4)
   goals met: 1 of 5
6. (przesun y z k2 k3)
   deleted: (on-rod y k2) (on-floor k2) (clear k3)
   added: (empty y) (on-rod z k2) (on-top k2 k3)
   goals met: 2 of 5
7. (przesun x z k1 k2)
   deleted: (on-rod x k1) (on-top k1 k4) (clear k2)
   added: (on-rod z k1) (clear k4) (on-top k1 k2)
   goals met: 3 of 5
8. (przesun-na-pusty x y k4)
   deleted: (empty y) (on-rod x k4) (on-top k4 k5)
   added: (on-rod y k4) (on-floor k4) (clear k5)
   goals met: 3 of 5
9. (przesun z y k1 k4)
   deleted: (on-rod z k1) (on-top k1 k2) (clear k4)
   added: (on-rod y k1) (clear k2) (on-top k1 k4)
   goals met: 2 of 5
10. (przesun z x k2 k5)
   deleted: (on-rod z k2) (on-top k2 k3) (clear k5)
   added: (on-rod x k2) (clear k3) (on-top k2 k5)
   goals met: 1 of 5
11. (przesun y x k1 k2)
   deleted: (on-rod y k1) (on-top k1 k4) (clear k2)
   added: (on-rod x k1) (clear k4) (on-top k1 k2)
   goals met: 1 of 5
12. (przesun z y k3 k4)
   deleted: (on-rod z k3) (on-floor k3) (clear k4)
   added: (empty z) (on-rod y k3) (on-top k3 k4)
   goals met: 0 of 5
13. (przesun-na-pusty x z k1)
   deleted: (empty z) (on-rod x k1) (on-top k1 k2)
   added: (on-rod z k1) (on-floor k1) (clear k2)
   goals met: 1 of 5
14. (przesun x y k2 k3)
   deleted: (on-rod x k2) (on-top k2 k5) (clear k3)
   added: (on-rod y k2) (clear k5) (on-top k2 k3)
   goals met: 1 of 5
15. (przesun z y k1 k2)
   deleted: (on-rod z k1) (on-floor k1) (clear k2)
   added: (empty z) (on-rod y k1) (on-top k1 k2)
   goals met: 0 of 5
16. (przesun-na-pusty x z k5)
   deleted: (empty z) (on-rod x k5)
   added: (empty x) (on-rod z k5)
   goals met: 1 of 5
17. (przesun-na-pusty y x k1)
   deleted: (empty x) (on-rod y k1) (on-top k1 k2)
   added: (on-rod x k1) (on-floor k1) (clear k2)
   goals met: 1 of 5
18. (przesun y z k2 k5)
   deleted: (on-rod y k2) (on-top k2 k3) (clear k5)
   added: (on-rod z k2) (clear k3) (on-top k2 k5)
   goals met: 2 of 5
19. (przesun x z k1 k2)
   deleted: (on-rod x k1) (on-floor k1) (clear k2)
   added: (empty x) (on-rod z k1) (on-top k1 k2)
   goals met: 3 of 5
20. (przesun-na-pusty y x k3)
   deleted: (empty x) (on-rod y k3) (on-top k3 k4)
   added: (on-rod x k3) (on-floor k3) (clear k4)
   goals met: 3 of 5
21. (przesun z y k1 k4)
   deleted: (on-rod z k1) (on-top k1 k2) (clear k4)
   added: (on-rod y k1) (clear k2) (on-top k1 k4)
   goals met: 2 of 5
22. (przesun z x k2 k3)
   deleted: (on-rod z k2) (on-top k2 k5) (clear k3)
   added: (on-rod x k2) (clear k5) (on-top k2 k3)
   goals met: 1 of 5
23. (przesun y x k1 k2)
   deleted: (on-rod y k1) (on-top k1 k4) (clear k2)
   added: (on-rod x k1) (clear k4) (on-top k1 k2)
   goals met: 1 of 5
24. (przesun y z k4 k5)
   deleted: (on-rod y k4) (on-floor k4) (clear k5)
   added: (empty y) (on-rod z k4) (on-top k4 k5)
   goals met: 2 of 5
25. (przesun x z k1 k4)
   deleted: (on-rod x k1) (on-top k1 k2) (clear k4)
   added: (on-rod z k1) (clear k2) (on-top k1 k4)
   goals met: 3 of 5
26. (przesun-na-pusty x y k2)
   deleted: (empty y) (on-rod x k2) (on-top k2 k3)
   added: (on-rod y k2) (on-floor k2) (clear k3)
   goals met: 3 of 5
27. (przesun z y k1 k2)
   deleted: (on-rod z k1) (on-top k1 k4) (clear k2)
   added: (on-rod y k1) (clear k4) (on-top k1 k2)
   goals met: 2 of 5
28. (przesun x z k3 k4)
   deleted: (on-rod x k3) (on-floor k3) (clear k4)
   added: (empty x) (on-rod z k3) (on-top k3 k4)
   goals met: 3 of 5
29. (przesun-na-pusty y x k1)
   deleted: (empty x) (on-rod y k1) (on-top k1 k2)
   added: (on-rod x k1) (on-floor k1) (clear k2)
   goals met: 3 of 5
30. (przesun y z k2 k3)
   deleted: (on-rod y k2) (on-floor k2) (clear k3)
   added: (empty y) (on-rod z k2) (on-top k2 k3)
   goals met: 4 of 5
31. (przesun x z k1 k2)
   deleted: (on-rod x k1) (on-floor k1) (clear k2)
   added: (empty x) (on-rod z k1) (on-top k1 k2)
   goals met: 5 of 5
